     A                                      INDARA
     A          R PRODSFL                   SFL
     A            QPUI00001      1A  O  2  2
     A            PRID          10A  H
     A            PRNAME        30A  H
     A          R QSFLCTL001                SFLCTL(PRODSFL)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A                                      SFLDSP
     A                                  1  2HTML('QPUISFLPRODCTL')
     A          R PRODCTL
     A                                  1  2HTML('QPUICTL1    PRODSFL   5    RS-
     A                                      FLDSP    0     RSFLDSPCTL 0     RSF-
     A                                      LCLR    0    FCLEARSFL  RSFLPAG    -
     A                                      1    C1    6 RSFLSIZ    1    C1    -
     A                                      7 0    0    ')
     A                                  1  3HTML('{"screen":{"record format nam-
     A                                      e":"PRODCTL","description":"Product-
     A                                       Control Record Format"},"items":[{-
     A                                      "id":"Grid1","field type":"grid","c-
     A                                      ss class":"crystal-grid","left":"20-
     A                                      px","top":"20px","number of rows":"-
     A                                      7","number of columns":"2","column -
     A                                      widths":"150,419","column headings"-
     A                                      :"Product Id,Product Name","header -
     A                                      height":"26","row height":"26","hei-
     A                                      ght":"182px","width":"570px","sorta-
     A                                      ble columns":"true","record format -
     A                                      name":"PRODSFL","description":"Prod-
     A                                      uct Subfile","clear subfile":{"fiel-
     A                                      dName":"ClearSFL","customTrue":"","-
     A                                      customFalse":"","dataType":"indicat-
     A                                      or","formatting":"Indicator","indFo-
     A                                      rmat":"true / false"}},{"id":"Butto-
     A                                      n1","field type":"styled button","v-
     A                                      alue":"Exit","left":"20px","top":"2-
     A                                      20px","width":"100px","height":"23p-
     A                                      x","button style":"Bright Gold","co-
     A                                      lor":"#000000","response":{"fieldNa-
     A                                      me":"btnExit","customTrue":"","cust-
     A                                      omFalse":"","dataType":"indicator",-
     A                                      "formatting":"Indicator","indFormat-
     A                                      ":"1 / 0"}},{"id":"OutputField1","f-
     A                                      ield type":"output field","css clas-
     A                                      s":"outputField","value":{"fieldNam-
     A                                      e":"PRID","dataLength":"10","trimLe-
     A                                      ading":"false","trimTrailing":"true-
     A                                      ","blankFill":"false","rjZeroFill":-
     A                                      "false","dataType":"char","formatti-
     A                                      ng":"Text","textTransform":"none","-
     A                                      designValue":"[PRID]"},"left":"10px-
     A                                      ","top":"5px","grid":"Grid1","colum-
     A                                      n":"0"},{"id":"OutputField2","field-
     A                                       type":"output field","css class":"-
     A                                      outputField","value":{"fieldName":"-
     A                                      PRNAME","dataLength":"30","trimLead-
     A                                      ing":"false","trimTrailing":"true",-
     A                                      "blankFill":"false","rjZeroFill":"f-
     A                                      alse","dataType":"char","formatting-
     A                                      ":"Text","textTransform":"none","de-
     A                                      signValue":"[PRNAME]"},"left":"10px-
     A                                      ","top":"5px","grid":"Grid1","colum-
     A                                      n":"1"}]}')
     A            BTNEXIT        1A  H
     A            CLEARSFL       1A  H
